# Завдання 1
# Макс 40 балів
# написати програму, яка просить в користувача ввести через пробіл міста, в яких він був
# за минулі 10 років
# потім окремо запросити у користувача міста, куди він хоче поїхати внаступні 10 років
# вивести на екран повідомлення з текстом про те, що користувачу, мабуть, дуже сподобалося
# в містах, які він повторив в
# двох циклах вводу, а саме... (сформувати строку, використовуючи join)
# якщо повтору не було - вивести повідомлення, що користувач відкритий до чогось нового
# врахувати випадки, що користувач нічого не вводить не потрібно, в даному випадку вам явно
# зазначено, що ці перевірки не потрібні. не потрібно перевіряти введення цифр
# ми виходим із того, що користувач введе щось на зразок "Київ Тернопіль париЖ акапулько-80"
# В той же час врахуйте, що користувач може вводити дані в різних регістрах використати сети!!!

past_cities = input("Enter the cities you've been to in the past 10 years,"
                    " using a space: ")
past_cities = past_cities.lower()
past_cities = past_cities.split()
set_past_cities = set(past_cities)


future_cities = input("Enter the cities you want to travel to in the next 10 years "
                           "using a space: ")
future_cities = future_cities.lower()
future_cities = future_cities.split()
set_future_cities = set(future_cities)

similar_choise = set_past_cities & set_future_cities

if similar_choise:
    print(f'You must have really enjoyed yourself in these cities {similar_choise}')
else:
    print('Great! You are open to something new')

# Завдання 2
# зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку
# здійснюється за механізмом student[outer_dict_key][inner_dict_key]
# Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
# не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
# """

student = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 14,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 16,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}

# 1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення,
#     бал від 0 до 100 (інт чи флоат)
student['Дмитро Галич'] = {'Пошта': 'dmytro@gmail.com', 'Вік': 28,
                           'Номер телефону': '+380986675666', 'Середній бал': 75}

# 2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
#     сам формат наповнення цього списку up to you
for key, value in student.items():
    if value['Середній бал'] > 90:
        print(f"Середній бал {key}: {value['Середній бал']}")

# 3 - визначити середній бал по групі
# method 1
list = student.values()
sum = sum(item['Середній бал'] for item in list)
result = (sum / len(list))
print(f'Середній бал групи: {result}')

# method 2
suma = 0
count = 0
for value in student.values():
    count += 1
    suma += value['Середній бал']

average_goal = suma / count
print(f"Середній бал групи: {average_goal}")

# 4 - при відсутності номеру телефону у студента записати номер батьків (номер на ваш вибір)
for value in student.values():
    student.get('Номер телефону')
    if value['Номер телефону'] is None:
        value['Номер телефону'] = '+380678889090'

print(student)





